framework/src/main/resources/api/soapActions/account_GetProfileID.xml

<se:Envelope xmlns:se="http://schemas.xmlsoap.org/soap/envelope/">
    <se:Header xmlns:sfns="http://soap.sforce.com/schemas/package/ProfileIntegrations_v2">
        <sfns:SessionHeader>
            <sessionId>EC_AUTH_TOKEN</sessionId>
        </sfns:SessionHeader>
    </se:Header>
    <se:Body>
        <ProfileInt_v2 xmlns="http://soap.sforce.com/schemas/package/ProfileIntegrations_v2">
            <accountId>EC_ACCOUNT_ID</accountId>
        </ProfileInt_v2>
    </se:Body>
</se:Envelope>